Revit 2027 API
BuiltInFailures.PerformanceFailures.InteriorCategoriesEnabledInLargeView Property
 Interior categories are enabled in a large view. Even though these objects may be obscured and invisible, they still have negative impact on performance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InteriorCategoriesEnabledInLargeView { get; }
Public Shared ReadOnly Property InteriorCategoriesEnabledInLargeView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InteriorCategoriesEnabledInLargeView {
	FailureDefinitionId^ get ();
}
static member InteriorCategoriesEnabledInLargeView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace